import { List } from "@/types/list";

export const baseElementsData = [
  {
    title: "Типографика:",
    elements: [
      "Шрифты должны быть читаемыми и гармоничными.",
      "Используйте не более 2-3 шрифтов на одном проекте.",
    ],
  },
  {
    title: "Цветовая палитра:",
    elements: [
      "Цвета помогают передавать эмоции и акценты.",
      "Используйте контрастные цвета для улучшения читаемости.",
    ],
  },
  {
    title: "Интерактивные элементы:",
    elements: [
      "Анимации и эффекты должны быть плавными и ненавязчивыми.",
      "Подсветка активных элементов помогает ориентироваться.",
    ],
  },
  {
    title: "Кнопки и иконки:",
    elements: [
      "Должны быть узнаваемыми и соответствовать общей стилистике.",
      "Размер кнопок должен быть удобным для нажатия.",
    ],
  },
];

export const uiPrinciplesData: List[] = [
  {
    elements: [
      "Простота: меньше — лучше. Не перегружайте интерфейс.",
      "Последовательность: элементы должны вести себя предсказуемо.",
      "Доступность: интерфейс должен быть удобным для всех пользователей, включая людей с ограниченными возможностями.",
    ],
  },
];

export const uiKitAdvantagesData: List[] = [
  {
    title: "Экономия времени:",
    elements: ["Нет необходимости разрабатывать элементы с нуля."],
  },
  { title: "Единый стиль:", elements: ["Все элементы выглядят согласованно."] },
  {
    title: "Удобство для команды:",
    elements: ["Легче передавать проект другим дизайнерам или разработчикам."],
  },
];

export const howToUseUiKitData: List[] = [
  {
    title: "Выберите подходящий набор:",
    elements: [
      "Существуют платные и бесплатные UI Kit. Например, Material Design от Google или Bootstrap.",
    ],
  },
  {
    title: "Настройте под свои нужды:",
    elements: ["Измените цвета, размеры или стили элементов."],
  },
  {
    title: "Внедрите в проект:",
    elements: [
      "Импортируйте UI Kit в программу для дизайна, такую как Figma или Adobe XD.",
    ],
  },
];

export const moodboardGoalsData: List[] = [
  {
    title: "Для вдохновения:",
    elements: ["Помогает собрать идеи и стилистические референсы."],
  },
  {
    title: "Для согласования:",
    elements: ["Удобно показывать заказчику для обсуждения концепции."],
  },
  {
    title: "Для организации:",
    elements: ["Структурирует визуальные элементы проекта."],
  },
];

export const moodboardInstrumentsData: List[] = [
  {
    title: "Начните с мудборда:",
    elements: ["Определите общую стилистику проекта."],
  },
  {
    title: "Используйте UI Kit:",
    elements: ["Подберите элементы, которые соответствуют вашей концепции."],
  },
  {
    title: "Разработайте интерфейс:",
    elements: [
      "Примените принципы UI-дизайна, чтобы создать удобный и красивый продукт.",
    ],
  },
];
