export const uxuiData = [
    {
        title: "Исследование и анализ данных",
        description: "Изучение сферы и рынка, определение выборки, проведение интервью, определение функционала"
    },
    {
        title: "UI дизайн, UI-Kit и мудборд",
        description: "Отрисовка интерфейса в Figma, определение дизайн-концепци, сборка moodboard, сборка Ui-kit"
    },
    {
        title: "Интерактивный прототип",
        description: "Изучение сферы и рынка, определение выборки, проведение интервью, определение функционала"
    },
]

export const programmingData = [
    {
        title: "Основы верстки и веселый веб",
        description: "Изучим основы верстки. Именно здесь вы узнаете что такое “Жопа слона” и своруем шрифт Вкусвилла"
    },
    {
        title: "Практика и верстка разныз страниц",
        description: "Попрактикуемся сверстаем сначала портфолио, а затем и наш проект с адаптивом на все устройства"
    },
    {
        title: "Здесь будет что-то новое",
        description: "Текст для блока, будет много строк или мало, это неважно, но сделать надо и подумать желательно"
    },
]

export const toolsData = [
    {
        img: "/figma.svg",
        title: "Figma"
    },
    {
        img: "/html.svg",
        title: "Html"
    },
    {
        img: "/css.svg",
        title: "Css"
    },
]